z2care/STM32F407VET6_OV5640_Barcode_Common/Core/Inc/usart.h
#ifndef _USART_H
#define _USART_H

#include "stm32f4xx_hal.h"
#include "stdio.h"	 	  	


int fputc(int ch, FILE *f) ;

#endif













#ifdef MAINBAKCUP

#define RAW //RAW format

#include "main.h"
//OV2640 SXGA初始化寄存器序列表
//SXGA(1600*1200)

const uint8_t ov2640_sxga_init_reg_tbl[][2]=
{
	0xff, 0x00,
	0x2c, 0xff,  //RSV
	0x2e, 0xdf,  //RSV

	0xff, 0x01,
	0x3c, 0x32,  //RSV
	0x11, 0x01,  //CLOCK DIVIDER
	0x09, 0x02,  //STANDBY MODE AND OUT DRIVER
	0x04, 0x20,  //MIRROR AND FLIP
	0x13, 0xe5,  //AGC AND EXPLOSURE CONTROL
	0x14, 0x48,  //AGC GAIN
	0x2c, 0x0c,  //RSV
	0x33, 0x78,  //RSV
	0x3a, 0x33,  //RSV
	0x3b, 0xfB,  //RSV
	0x3e, 0x00,  //RSV
	0x43, 0x11,  //RSV
	0x16, 0x10,  //RSV
	0x39, 0x92,  //RSV
	0x35, 0xda,  //RSV
	0x22, 0x1a,  //RSV
	0x37, 0xc3,  //RSV
	0x23, 0x00,  //RSV
	0x34, 0xc0,  //RSV, ZOOM WINDOW HORIZENTAL START POINT
	0x36, 0x1a,  //RSV
	0x06, 0x88,  //RSV
	0x07, 0xc0,  //RSV
	0x0d, 0x87,  //CLOCK OUTPUT PIN STATUS IN POWER-DOWN
	0x0e, 0x41,  //RSV
	0x4c, 0x00,  //RSV
	0x48, 0x00,  //ZOOM WINDOW VERTICAL START POINT
	0x5B, 0x00,  //RSV
	0x42, 0x03,  //RSV
	0x4a, 0x81,  //RSV
	0x21, 0x99,  //RSV
	0x24, 0x40,  //LUMINANCE SIGNAL HIGH THRESHOLD FOR AGC/AEC
	0x25, 0x38,  //LUMINANCE SIGNAL LOW THRESHOLD FOR AGC/AEC
	0x26, 0x82,  //FAST MODE LARGE STEP RANGE THRESHOLD
	0x5c, 0x00,  //RSV
	0x63, 0x00,  //RSV
	0x46, 0x00,  //FRAME LENGTH ADJUSTMENT LSBS
	0x0c, 0x3c,  //BANDING AND SNAPSHOT OPTION
	0x61, 0x70,  //HISTOGRAM ALGORITHM LOW LEVEL
	0x62, 0x80,  //HISTOGRAM ALGORITHM HIGH LEVEL
	0x7c, 0x05,  //RSV
	0x20, 0x80,  //RSV
	0x28, 0x30,  //RSV
	0x6c, 0x00,  //RSV
	0x6d, 0x80,  //RSV
	0x6e, 0x00,  //RSV
	0x70, 0x02,  //RSV
	0x71, 0x94,  //RSV
	0x73, 0xc1,  //RSV
	0x3d, 0x34,  //RSV
	0x5a, 0x57,  //RSV
	0x12, 0x00, //UXGA 1600*1200, NO ZOOM, NO COLOR BAR
	0x17, 0x11,  //HORIZONTAL WINDOW START MSB 8 BITS
	0x18, 0x75,  //HORIZONTAL WINDOW END MSB 8BITS
	0x19, 0x01,  //VERTICAL WINDOW LINE START MSB 8 BITS
	0x1a, 0x97,  //VERTICAL WINDOW LINE END MSB 8 BITS
	0x32, 0x36,  //PCLK DIVIDER, HORIZONTAL WINDOW END LSB 3BITS,HORIZONTAL WINDOW START LSB 3BITS
	0x03, 0x0f,  //Dummy frame control, VERTICAL WINDOW LINE END LSB 2 BITS, VERTICAL WINDOW LINE START LSB 2 BITS
	0x37, 0x40,  //RSV
	0x4f, 0xca,  //50HZ BANDING AEC 8 LSBS
	0x50, 0xa8,  //60HZ BANDING AEC 8 LSBS
	0x5a, 0x23,  //RSV
	0x6d, 0x00,  //RSV
	0x6d, 0x38,  //RSV
	0xff, 0x00,
	0xe5, 0x7f,  //RSV
	0xf9, 0xc0,  //MCU RESET, BOOT ROM SELECT
	0x41, 0x24,  //RSV
    0xe0, 0x14,  //RESET CONTROL FOR MCU, SCCB, JPEG, DVP, IPU & CIF
	0x76, 0xff,  //RSV
	0x33, 0xa0,  //RSV
	0x42, 0x20,  //RSV
	0x43, 0x18,  //RSV
	0x4c, 0x00,  //RSV
	0x87, 0xd5,  //MODULE ENABLE FOR BPC, WPC
	0x88, 0x3f,  //RSV
	0xd7, 0x03,  //RSV
	0xd9, 0x10,  //RSV
	0xd3, 0x82,  //AUTO MODE, DVP OUTPUT SPEED
	0xc8, 0x08,  //RSV
	0xc9, 0x80,  //RSV
	0x7c, 0x00,  //SDE INDIRECT REGISTER ACCSS: ADDRESS
	0x7d, 0x00,  //SED INDIRECT REGISTER ACCESS: DATA
	0x7c, 0x03,  //SDE INDIRECT REGISTER ACCSS: ADDRESS
	0x7d, 0x48,  //SED INDIRECT REGISTER ACCESS: DATA
	0x7d, 0x48,  //SED INDIRECT REGISTER ACCESS: DATA
	0x7c, 0x08,  //SDE INDIRECT REGISTER ACCSS: ADDRESS
	0x7d, 0x20,  //SED INDIRECT REGISTER ACCESS: DATA
	0x7d, 0x10,  //SED INDIRECT REGISTER ACCESS: DATA
	0x7d, 0x0e,  //SED INDIRECT REGISTER ACCESS: DATA
	0x90, 0x00,  //RSV
	0x91, 0x0e,  //RSV
	0x91, 0x1a,  //RSV
	0x91, 0x31,  //RSV
	0x91, 0x5a,  //RSV
	0x91, 0x69,  //RSV
	0x91, 0x75,  //RSV
	0x91, 0x7e,  //RSV
	0x91, 0x88,  //RSV
	0x91, 0x8f,  //RSV
	0x91, 0x96,  //RSV
	0x91, 0xa3,  //RSV
	0x91, 0xaf,  //RSV
	0x91, 0xc4,  //RSV
	0x91, 0xd7,  //RSV
	0x91, 0xe8,  //RSV
	0x91, 0x20,  //RSV
	0x92, 0x00,  //RSV
	0x93, 0x06,  //RSV
	0x93, 0xe3,  //RSV
	0x93, 0x05,  //RSV
	0x93, 0x05,  //RSV
	0x93, 0x00,  //RSV
	0x93, 0x04,  //RSV
	0x93, 0x00,  //RSV
	0x93, 0x00,  //RSV
	0x93, 0x00,  //RSV
	0x93, 0x00,  //RSV
	0x93, 0x00,  //RSV
	0x93, 0x00,  //RSV
	0x93, 0x00,  //RSV
	0x96, 0x00,  //RSV
	0x97, 0x08,  //RSV
	0x97, 0x19,  //RSV
	0x97, 0x02,  //RSV
	0x97, 0x0c,  //RSV
	0x97, 0x24,  //RSV
	0x97, 0x30,  //RSV
	0x97, 0x28,  //RSV
	0x97, 0x26,  //RSV
	0x97, 0x02,  //RSV
	0x97, 0x98,  //RSV
	0x97, 0x80,  //RSV
	0x97, 0x00,  //RSV
	0x97, 0x00,  //RSV
	0xc3, 0xef,  //MODULE ENABLE FOR CIP, CMY, RAW_GMA, DG, AWB, AWB_GAIN, LENC, PRE
	0xa4, 0x00,  //RSV
	0xa8, 0x00,  //RSV
	0xc5, 0x11,  //RSV
	0xc6, 0x51,  //RSV
	0xbf, 0x80,  //RSV
	0xc7, 0x10,  //RSV
	0xb6, 0x66,  //RSV
	0xb8, 0xA5,  //RSV
	0xb7, 0x64,  //RSV
	0xb9, 0x7C,  //RSV
	0xb3, 0xaf,  //RSV
	0xb4, 0x97,  //RSV
	0xb5, 0xFF,  //RSV
	0xb0, 0xC5,  //RSV
	0xb1, 0x94,  //RSV
	0xb2, 0x0f,  //RSV
	0xc4, 0x5c,  //RSV
	0xc0, 0xc8,  //IMAGE HORIZENTAL SIZE HSIZE[10:3]
	0xc1, 0x96,  //IMAGE VERTICAL VSIZE[10:3]
	0x8c, 0x00,  //{HSIZE[11], HSIZE[2:0], VSIZE[2:0]}
	0x86, 0x3d,  //MODULE ENABLE FOR DCW, SDE, UV_ADJ, UV_AVG, CMX
	0x50, 0x00,  //LP_DP, V_DIVIDER, H_DIVIDER
	0x51, 0x90,  //H_SIZE[7:0](REAL/4)
	0x52, 0x2c,  //V_SIZE[7:0](REAL/4)
	0x53, 0x00,  //OFFSET_X[7:0]
	0x54, 0x00,  //OFFSET_Y[7:0]
	0x55, 0x88,  //V_SIZE[8], OFFSET_Y[10:8], H_SIZE[8], OFFSET_X[10:8]
	0x5a, 0x90,  //OUTW[7:0](REAL/4)
	0x5b, 0x2C,  //OUTH[7:0](REAL/4)
	0x5c, 0x05,  //ZOOM SPEED, OUTH[8], OUTW[9:8]
	0xd3, 0x82,  //AUTO MODE, DVP OUTPUT SPEED
    0xc3, 0xed,  //MODULE ENABLE FOR CIP, CMY, RAW_GMA, DG, AWB, AWB_GAIN, LENC, PRE
	0x7f, 0x00,  //RSV
	0xda, 0x08,  //IMAGE OUTPUT FORMAT SELECT
	0xe5, 0x1f,  //RSV
	0xe1, 0x67,  //RSV
	0xe0, 0x00,  //RESET FOR MCU, SCCB, JPEG, DVP, IPU, CIF
	0xdd, 0x7f,  //RSV
    0x05, 0x00,  //use DSP
	0xff, 0x01,
	0x15, 0x00   //PCLK, HREF, VSYNC POLARITY

};

//sxga raw
const uint8_t ov2640_sxga_init_reg_tbl_raw[][2]=
{
		0xff, 0x00,
		0x2c, 0x0c,  //adjust the value to see kinds of effects
		0x2e, 0xdf,
		0x33, 0x78,
		0x3a, 0x33,
		0x3b, 0xfb,
		0x3e, 0x00,
		0x43, 0x11,
		0x16, 0x10,
		0x39, 0x92,
        0x35, 0xda,
		0x22, 0x1a,
		0x37, 0xc3,
		0x23, 0x00,
		0x34, 0xc0,
		0x36, 0x1a,
		0x06, 0x88,
		0x07, 0xc0,
		0x0d, 0x87,
		0x0e, 0x41,
		0x4c, 0x00,
		0x48, 0x00,
		0x5b, 0x00,
		0x42, 0x03,
		0x4a, 0x81,
		0x21, 0x99,
		0x24, 0x40,
		0x25, 0x38,
		0x26, 0x82,
		0x5c, 0x00,
		0x63, 0x00,
		0x46, 0x22,
		0x0c, 0x3c,
		0x61, 0x70,
		0x62, 0x80,
		0x7c, 0x05,
		0x20, 0x80,
		0x6c, 0x00,
		0x6d, 0x80,
		0x6e, 0x00,
		0x70, 0x02,
		0x71, 0x94,
		0x73, 0xc1,
	    0X44, 0x06, //Quantization scale factor
    0XFF,0x01,
	0x3c, 0x32,
	0X03, 0x0f,   //common control 1
	0X04, 0x0c,   //register 04
	//0X09,0x00,
	0x11, 0x01,  //CLOCK DIVIDER
	0x09, 0x02,  //STANDBY MODE AND OUT DRIVER
	//0x04, 0x20,  //MIRROR AND FLIP
	0x04, 0x28,  //MIRROR AND FLIP
	0x13, 0xe5,  //AGC AND EXPLOSURE CONTROL
	0x14, 0x48,  //AGC GAIN
	0x34, 0xc0,  //RSV, ZOOM WINDOW HORIZENTAL START POINT
	0x0d, 0x87,  //CLOCK OUTPUT PIN STATUS IN POWER-DOWN
	0x48, 0x00,  //ZOOM WINDOW VERTICAL START POINT
	0x24, 0x40,  //LUMINANCE SIGNAL HIGH THRESHOLD FOR AGC/AEC
	0x25, 0x38,  //LUMINANCE SIGNAL LOW THRESHOLD FOR AGC/AEC
	0x26, 0x82,  //FAST MODE LARGE STEP RANGE THRESHOLD
	0x46, 0x00,  //FRAME LENGTH ADJUSTMENT LSBS
	0x0c, 0x3c,  //BANDING AND SNAPSHOT OPTION
	0x61, 0x70,  //HISTOGRAM ALGORITHM LOW LEVEL
	0x62, 0x80,  //HISTOGRAM ALGORITHM HIGH LEVEL
	0x12, 0x00, //UXGA 1600*1200, NO ZOOM, NO COLOR BAR
	0x17, 0x11,  //HORIZONTAL WINDOW START MSB 8 BITS
	0x18, 0x75,  //HORIZONTAL WINDOW END MSB 8BITS
	0x19, 0x01,  //VERTICAL WINDOW LINE START MSB 8 BITS
	0x1a, 0x97,  //VERTICAL WINDOW LINE END MSB 8 BITS
	0x32, 0x36,  //PCLK DIVIDER, HORIZONTAL WINDOW END LSB 3BITS,HORIZONTAL WINDOW START LSB 3BITS
	0x03, 0x0f,  //Dummy frame control, VERTICAL WINDOW LINE END LSB 2 BITS, VERTICAL WINDOW LINE START LSB 2 BITS
	0x4f, 0xca,  //50HZ BANDING AEC 8 LSBS

	0xff, 0x00,
	0xe5, 0x7f,
	0xf9, 0xc0,  //MCU RESET, BOOT ROM SELECT
	0x41, 0x24,
//	0xe0, 0x14,  //RESET CONTROL FOR MCU, SCCB, JPEG, DVP, IPU & CIF
	0xe0, 0x04,  //RESET CONTROL FOR MCU, SCCB, JPEG, DVP, IPU & CIF
	0x76, 0xff,
	0x33, 0xa0,
	0x42, 0x20,
	0x43, 0x18,
	0x4c, 0x00,
	0x87, 0xd5,  //MODULE ENABLE FOR BPC, WPC
	0x88, 0x3f,
	0xd7, 0x03,
	0xd9, 0x10,
	0xd3, 0x82,  //AUTO MODE, DVP OUTPUT SPEED
	0x7c, 0x00,  //SDE INDIRECT REGISTER ACCSS: ADDRESS
	0x7d, 0x00,  //SED INDIRECT REGISTER ACCESS: DATA
	0x7c, 0x03,  //SDE INDIRECT REGISTER ACCSS: ADDRESS
	0x7d, 0x48,  //SED INDIRECT REGISTER ACCESS: DATA
	0x7d, 0x48,  //SED INDIRECT REGISTER ACCESS: DATA
	0x7c, 0x08,  //SDE INDIRECT REGISTER ACCSS: ADDRESS
	0x7d, 0x20,  //SED INDIRECT REGISTER ACCESS: DATA
	0x7d, 0x10,  //SED INDIRECT REGISTER ACCESS: DATA
	0x7d, 0x0e,  //SED INDIRECT REGISTER ACCESS: DATA
	0x90, 0x00,
	0x91, 0x0e,
	0x91, 0x1a,
	0x91, 0x31,
	0x91, 0x5a,
	0x91, 0x69,
	0x91, 0x75,
	0x91, 0x7e,
	0x91, 0x88,
	0x91, 0x8f,
	0x91, 0x96,
	0x91, 0xa3,
	0x91, 0xaf,
	0x91, 0xc4,
	0x91, 0xd7,
	0x91, 0xe8,
	0x91, 0x20,
	0x92, 0x00,
	0x93, 0x06,
	0x93, 0xe3,
	0x93, 0x05,
	0x93, 0x05,
	0x93, 0x00,
	0x93, 0x04,
	0x93, 0x00,
	0x93, 0x00,
	0x93, 0x00,
	0x93, 0x00,
	0x93, 0x00,
	0x93, 0x00,
	0x93, 0x00,
	0x96, 0x00,
	0x97, 0x08,
	0x97, 0x19,
	0x97, 0x02,
	0x97, 0x0c,
	0x97, 0x24,
	0x97, 0x30,
	0x97, 0x28,
	0x97, 0x26,
	0x97, 0x02,
	0x97, 0x98,
	0x97, 0x80,
	0x97, 0x00,
	0x97, 0x00,
	0xa4, 0x00,
	0xa8, 0x00,
	0xc5, 0x11,
	0xc6, 0x51,
	0xbf, 0x80,
	0xc7, 0x10,
	0xb6, 0x66,
	0xb8, 0xA5,
	0xb7, 0x64,
	0xb9, 0x7C,
	0xb3, 0xaf,
	0xb4, 0x97,
	0xb5, 0xFF,
	0xb0, 0xC5,
	0xb1, 0x94,
	0xb2, 0x0f,
	0xc4, 0x5c,
	//0xc3, 0xef,  //MODULE ENABLE FOR CIP, CMY, RAW_GMA, DG, AWB, AWB_GAIN, LENC, PRE
	0xc3, 0xed,
	0xc0, 0xc8,  //IMAGE HORIZENTAL SIZE HSIZE[10:3]
	0xc1, 0x96,  //IMAGE VERTICAL VSIZE[10:3]
	0x8c, 0x00,  //{HSIZE[11], HSIZE[2:0], VSIZE[2:0]}
	0x86, 0x3d,  //MODULE ENABLE FOR DCW, SDE, UV_ADJ, UV_AVG, CMX
	0x50, 0x00,  //LP_DP, V_DIVIDER, H_DIVIDER
	0x51, 0x90,  //H_SIZE[7:0](REAL/4)
	0x52, 0x2c,  //V_SIZE[7:0](REAL/4)
	0x53, 0x00,  //OFFSET_X[7:0]
	0x54, 0x00,  //OFFSET_Y[7:0]
	0x55, 0x88,  //V_SIZE[8], OFFSET_Y[10:8], H_SIZE[8], OFFSET_X[10:8]
	0x5a, 0x90,  //OUTW[7:0](REAL/4)
	0x5b, 0x2C,  //OUTH[7:0](REAL/4)
	0x5c, 0x05,  //ZOOM SPEED, OUTH[8], OUTW[9:8]
	0xd3, 0x82,  //AUTO MODE, DVP OUTPUT SPEED
	//0xc3, 0xed,  //MODULE ENABLE FOR CIP, CMY, RAW_GMA, DG, AWB, AWB_GAIN, LENC, PRE
	0xc3, 0xed,
	0xda, 0x08,  //IMAGE OUTPUT FORMAT SELECT

