z2care/STM32F407VET6_OV5640_Barcode_Common/Core/Inc/usart.h
    SCCB_WR_Reg(0XFF,0X01);
    temp=SCCB_RD_Reg(0X03);                //读取Vref之前的值
    temp&=0XF0;
    temp|=((endy&0X03)<<2)|(sy&0X03);
    SCCB_WR_Reg(0X03,temp);                //设置Vref的start和end的最低2位
    SCCB_WR_Reg(0X19,sy>>2);               //设置Vref的start的高8位
    SCCB_WR_Reg(0X1A,endy>>2);             //设置Vref的end的高8位

    temp=SCCB_RD_Reg(0X32);                //读取Href之前的值
    temp&=0XC0;
    temp|=((endx&0X07)<<3)|(sx&0X07);
    SCCB_WR_Reg(0X32,temp);                //设置Href的start和end的最低3位
    SCCB_WR_Reg(0X17,sx>>3);               //设置Href的start高8位
    SCCB_WR_Reg(0X18,endx>>3);             //设置Href的end的高8位
}
//设置图像输出大小
//OV2640输出图像的大小(分辨率),完全由改函数确定
//width,height:宽度(对应:horizontal)和高度(对应:vertical),width和height必须是4的倍数
//for RGB565/YUV OV2640_OutSize_Set(w,h) outputs 2*w bytes for per line, and total h lines.
//返回:0,设置成功
//     其他,设置失败
uint8_t OV2640_OutSize_Set(uint16_t width,uint16_t height)
{
    uint16_t outh;
    uint16_t outw;
    uint8_t temp;
    if(width%4)return 1;
    if(height%4)return 2;
    outw=width/4;
    outh=height/4;
    SCCB_WR_Reg(0XFF,0X00);
    SCCB_WR_Reg(0XE0,0X04);
    SCCB_WR_Reg(0X5A,outw&0XFF);        //设置OUTW的低八位
    SCCB_WR_Reg(0X5B,outh&0XFF);        //设置OUTH的低八位
    temp=(outw>>8)&0X03;
    temp|=(outh>>6)&0X04;
    SCCB_WR_Reg(0X5C,temp);                //设置OUTH/OUTW的高�?????????
    SCCB_WR_Reg(0XE0,0X00);
    return 0;
}
//设置图像开窗大小
//由OV2640_ImageSize_Set确定传感器输出分辨率大小。
//该函数则在这个范围上面进行开窗，用于OV2640_OutSize_Set的输出
//注意:本函数的宽度和高度,必须大于等于OV2640_OutSize_Set函数的宽度和高度
//     OV2640_OutSize_Set设置的宽度和高度,根据本函数设置的宽度和高,由DSP
//     自动计算缩放比例,输出给外部设备
//width,height:宽度(对应:horizontal)和高度(对应:vertical),width和height必须是4的倍数
//返回值:0,设置成功
//    其他,设置失败
uint8_t OV2640_ImageWin_Set(uint16_t offx,uint16_t offy,uint16_t width,uint16_t height)
{
    uint16_t hsize;
    uint16_t vsize;
    uint8_t temp;
    if(width%4)return 1;
    if(height%4)return 2;
    hsize=width/4;
    vsize=height/4;
    SCCB_WR_Reg(0XFF,0X00);
    SCCB_WR_Reg(0XE0,0X04);
    SCCB_WR_Reg(0X51,hsize&0XFF);        //设置H_SIZE的低八位
    SCCB_WR_Reg(0X52,vsize&0XFF);        //设置V_SIZE的低八位
    SCCB_WR_Reg(0X53,offx&0XFF);        //设置offx的低八位
    SCCB_WR_Reg(0X54,offy&0XFF);        //设置offy的低八位
    temp=(vsize>>1)&0X80;
    temp|=(offy>>4)&0X70;
    temp|=(hsize>>5)&0X08;
    temp|=(offx>>8)&0X07;
    SCCB_WR_Reg(0X55,temp);                //设置H_SIZE/V_SIZE/OFFX,OFFY的高位
    SCCB_WR_Reg(0X57,(hsize>>2)&0X80);    //设置H_SIZE/V_SIZE/OFFX,OFFY的高位
    SCCB_WR_Reg(0XE0,0X00);
    return 0;
}
//该函数设置图像尺寸大小,也就是所选格式的输出分辨率
//UXGA:1600*1200,SVGA:800*600,CIF:352*288
//width,height:图像宽度和图像高度
//返回值:0,设置成功
//    其他,设置失败
uint8_t OV2640_ImageSize_Set(uint16_t width,uint16_t height)
{
    uint8_t temp;
    SCCB_WR_Reg(0XFF,0X00);
    SCCB_WR_Reg(0XE0,0X04);
    SCCB_WR_Reg(0XC0,(width)>>3&0XFF);        //设置HSIZE�?????????10:3�?????????
    SCCB_WR_Reg(0XC1,(height)>>3&0XFF);        //设置VSIZE�?????????10:3�?????????
    temp=(width&0X07)<<3;
    temp|=height&0X07;
    temp|=(width>>4)&0X80;
    SCCB_WR_Reg(0X8C,temp);
    SCCB_WR_Reg(0XE0,0X00);
    return 0;
}

//OV2640 mode: RGB565
void OV2640_RGB565_Mode(void)
{
	uint16_t i=0;

	for(i=0;i<(sizeof(ov2640_rgb565_reg_tbl)/2);i++)
	{
		SCCB_WR_Reg(ov2640_rgb565_reg_tbl[i][0],ov2640_rgb565_reg_tbl[i][1]);
	}
}

//OV2640 mode: yuv422
void OV2640_YUV422_Mode(void)
{
	uint16_t i=0;

	for(i=0;i<(sizeof(ov2640_yuv422_reg_tbl)/2);i++)
	{
		SCCB_WR_Reg(ov2640_yuv422_reg_tbl[i][0],ov2640_yuv422_reg_tbl[i][1]);
	}
}


#ifdef RAW  //RAW format

                                                 /* USER CODE BEGIN Header */
/**
  ******************************************************************************
  * @file           : main.c
  * @brief          : Main program body
  ******************************************************************************
  * @attention
  *
  * <h2><center>&copy; Copyright (c) 2020 STMicroelectronics.
  * All rights reserved.</center></h2>
  *
  * This software component is licensed by ST under BSD 3-Clause license,
  * the "License"; You may not use this file except in compliance with the
  * License. You may obtain a copy of the License at:
  *                        opensource.org/licenses/BSD-3-Clause
  *
  ******************************************************************************
  */
/* USER CODE END Header */
/* Includes ------------------------------------------------------------------*/
#include "main.h"

/* Private includes ----------------------------------------------------------*/
/* USER CODE BEGIN Includes */
#define RowNum 480
#define ColumnNum 1280

void DCMI_DMA_MemInc_En(void);
void DCMI_DMA_MemInc_Den(void);
void SPI2_ENDIAN_L(void) ;
void SPI2_ENDIAN_H(void) ;



/* USER CODE END Includes */

/* Private typedef -----------------------------------------------------------*/
/* USER CODE BEGIN PTD */
uint8_t aRxBuffer;			//接收中断缓冲
uint8_t Uart1_RxBuff[99] = {0};		//Rx buffer，should be adjusted according to Rx max byte length per communication.
uint8_t Uart2_RxBuff[99] = {0};		//Rx buffer，should be adjusted according to Rx max byte length per communication.
HAL_StatusTypeDef uart1_status_rx;
uint8_t Uart1_TxBuff[99] = {0};		//Tx buffer
uint8_t Uart4_TxBuff[2] = {0};			//Tx buffer
uint8_t StatusFlag = 0;

uint8_t ov2640_rd = 0xff;

uint8_t sram_wd;
uint8_t sram_rd;

uint8_t sram_TxCmd[4]={0x02,0x00,0x00,0x00};
uint8_t sram_TxData= 0x5a;
uint8_t sram_RxCmd[4]={0x03,0x00,0x00,0x00};
uint8_t sram_RxDummy= 0x00;
uint8_t sram_RxData= 0x00;

uint8_t sram_RxCmd_inv[4]={0xc0,0x00,0x00,0x00}; //for LSB of SPI2

HAL_StatusTypeDef spi_dma_status = HAL_OK;
HAL_StatusTypeDef dcmi_dma_status = HAL_OK;

uint32_t dcmi_data;

uint32_t dcmi_data_buff[19200]={0};

uint32_t vsync_counter = 0;
uint32_t line_counter = 0;
uint32_t point_counter =0;
uint32_t frame_counter =0;
uint32_t timing_ctr = 1;

uint8_t DCMI_CROP_EN = 0;
uint32_t DCMI_RN = 0;  //row number
uint32_t DCMI_CN = 0;  //column number
uint32_t DCMI_RS = 0;  //row start
uint32_t DCMI_CS = 0;  //column start


uint8_t scmd = 0;


