z2care/STM32F407VET6_OV5640_Barcode_Common/Core/Inc/usart.h
/* USER CODE END PTD */

/* Private define ------------------------------------------------------------*/
/* USER CODE BEGIN PD */

/* USER CODE END PD */

/* Private macro -------------------------------------------------------------*/
/* USER CODE BEGIN PM */

/* USER CODE END PM */

/* Private variables ---------------------------------------------------------*/
DCMI_HandleTypeDef hdcmi;
DMA_HandleTypeDef hdma_dcmi;

SPI_HandleTypeDef hspi2;
DMA_HandleTypeDef hdma_spi2_tx;

TIM_HandleTypeDef htim2;

UART_HandleTypeDef huart4;
UART_HandleTypeDef huart1;
UART_HandleTypeDef huart2;

/* USER CODE BEGIN PV */

/* USER CODE END PV */

/* Private function prototypes -----------------------------------------------*/
void SystemClock_Config(void);
static void MX_GPIO_Init(void);
static void MX_DMA_Init(void);
static void MX_USART1_UART_Init(void);
static void MX_TIM2_Init(void);
static void MX_SPI2_Init(void);
static void MX_DCMI_Init(void);
static void MX_UART4_Init(void);
static void MX_USART2_UART_Init(void);
static void MX_NVIC_Init(void);
/* USER CODE BEGIN PFP */

/* USER CODE END PFP */

/* Private user code ---------------------------------------------------------*/
/* USER CODE BEGIN 0 */

/* USER CODE END 0 */

/**
  * @brief  The application entry point.
  * @retval int
  */
int main(void)
{
  /* USER CODE BEGIN 1 */

  /* USER CODE END 1 */

  /* MCU Configuration--------------------------------------------------------*/

  /* Reset of all peripherals, Initializes the Flash interface and the Systick. */
  HAL_Init();

  /* USER CODE BEGIN Init */

  /* USER CODE END Init */

  /* Configure the system clock */
  SystemClock_Config();

  /* USER CODE BEGIN SysInit */

  /* USER CODE END SysInit */

  /* Initialize all configured peripherals */
  MX_GPIO_Init();
  MX_DMA_Init();
  MX_USART1_UART_Init();
  MX_TIM2_Init();
  MX_SPI2_Init();
  MX_DCMI_Init();
  MX_UART4_Init();
  MX_USART2_UART_Init();

  /* Initialize interrupts */
  MX_NVIC_Init();
  /* USER CODE BEGIN 2 */

  HAL_TIM_PWM_Start(&htim2, TIM_CHANNEL_1);
  HAL_Delay(100);

  if (HAL_UART_Receive_IT(&huart1, (uint8_t *)&aRxBuffer, 1)!=HAL_OK) printf("UART1 IT FAILED! \r\n");
  printf("Serial port connected!");
  printf("\r\n");
  HAL_UART_Receive_IT(&huart2, (uint8_t *)&aRxBuffer, 1);

    HAL_Delay(500); //must to await camera running stable
    SCCB_Rst();
    HAL_Delay(500);

	SCCB_WR_Reg(0xff, 0x01);
 	SCCB_WR_Reg(0x12, 0x80);

    HAL_Delay(100);

	ov2640_rd = SCCB_RD_Reg(0x1c);
	printf("PID = %d",ov2640_rd);
	printf("\r\n");
	ov2640_rd = SCCB_RD_Reg(0x1d);
	printf("VER = %d",ov2640_rd);
	printf("\r\n");

		/*UXGA Capture, 7.5fps, 24MHz input clock*/
	 	SCCB_WR_Reg(0xff, 0x01);
		SCCB_WR_Reg(0x11, 0x01);
		SCCB_WR_Reg(0x12, 0x00);
		SCCB_WR_Reg(0x2a, 0x00);
		SCCB_WR_Reg(0x2b, 0x00);
		SCCB_WR_Reg(0x46, 0x00);
		SCCB_WR_Reg(0x47, 0x00);
		SCCB_WR_Reg(0x3d, 0x34);

		for(uint32_t i=0; i<sizeof(ov2640_sxga_init_reg_tbl_raw)/2 ; i++)
	     {
	       SCCB_WR_Reg(ov2640_sxga_init_reg_tbl_raw[i][0],ov2640_sxga_init_reg_tbl_raw[i][1]);
		   if(i<10) HAL_Delay(5);
 	     }

		 OV2640_Window_Set(140,0,1624,732);


     OV2640_Color_Bar(0);
     OV2640_Auto_Exposure(2);
     OV2640_Special_Effects(0);
     OV2640_Light_Mode(0);    //自动模式
     OV2640_Color_Saturation(2);//色彩饱和�?
     OV2640_Brightness(2);    //亮度0
     OV2640_Contrast(2);        //对比�?

	 HAL_Delay(500); //pay attention

	   DCMI_CROP_EN = 1;
	   DCMI_RN = 159;  //row number
	   DCMI_CN = 320;  //column number
	   DCMI_RS = 0;  //row start
	   DCMI_CS = 0;  //column start
	   OV2640_PD ;
	   HAL_DCMI_DisableCrop (&hdcmi);
	   HAL_DCMI_ConfigCrop (&hdcmi, DCMI_CS, DCMI_RS, DCMI_CN, DCMI_RN);
	   HAL_DCMI_EnableCrop (&hdcmi);
	   dcmi_dma_status = HAL_DCMI_Start_DMA(&hdcmi, DCMI_MODE_SNAPSHOT, &dcmi_data, (DCMI_RN+1)*DCMI_CN/4); //65535 38400 (DCMI_RN+1)*DCMI_CN/4
	   OV2640_PU ;
	   printf("dcmi_dma_status = %d",dcmi_dma_status);
	   printf("\r\n");

	   HAL_Delay(250);  //pay attention

	   HAL_DCMI_Stop(&hdcmi);
		printf("\r\n");
		printf("vn = %d",vsync_counter);
		printf("\r\n");
		printf("ln = %d",line_counter);
		printf("\r\n");
		printf("pn = %d",point_counter);
		printf("\r\n");
		printf("fn = %d",frame_counter);
		printf("\r\n");


		HAL_GPIO_WritePin(GPIOE, GPIO_PIN_13, GPIO_PIN_RESET);
  /* USER CODE END 2 */

  /* Infinite loop */
  /* USER CODE BEGIN WHILE */
  while (1)
  {
    /* USER CODE END WHILE */

    /* USER CODE BEGIN 3 */

  	HAL_Delay(1);

    if (scmd==1)
    {
    	scmd = 0;

    }


    if (scmd==2)
    {
     	scmd = 0;

     	 vsync_counter = 0;
     	 line_counter = 0;
     	 frame_counter =0;
     	 point_counter = 0;


     	  DCMI_DMA_MemInc_En();

      	  HAL_DCMI_DisableCrop (&hdcmi);
      	  HAL_Delay(100);
       	  Uart4_TxBuff[0]=0x55;
          Uart4_TxBuff[1]=0xaa;
      	  HAL_UART_Transmit(&huart4, Uart4_TxBuff, 2, 0xFFFFFF);

    	  for (uint8_t i=0; i<13;i++)
    	  {
                OV2640_Window_Set(144,0+i*48,1600,48);
                HAL_Delay(100);

    		     dcmi_dma_status = HAL_DCMI_Init(&hdcmi);

    	    	 HAL_Delay(100);

    	    	 dcmi_dma_status = HAL_DCMI_Start_DMA(&hdcmi, DCMI_MODE_SNAPSHOT, dcmi_data_buff, 76800/4);

    	    	 HAL_Delay(200);

    	    	 HAL_DCMI_Stop(&hdcmi);

    	    	  HAL_UART_Transmit(&huart4, (uint8_t *)dcmi_data_buff, 38400, 0xFFFFFF);
    	    	  HAL_UART_Transmit(&huart4, (uint8_t *)(&dcmi_data_buff[38400/4]), 38400, 0xFFFFFF);
    	    	  //HAL_Delay(200);

    	        	memset(dcmi_data_buff, 0, 76800);
    	        	HAL_Delay(10);


    	  }



     }


  }
  /* USER CODE END 3 */
}

/**
  * @brief System Clock Configuration
  * @retval None
  */
void SystemClock_Config(void)
{
  RCC_OscInitTypeDef RCC_OscInitStruct = {0};
  RCC_ClkInitTypeDef RCC_ClkInitStruct = {0};

  /** Configure the main internal regulator output voltage
  */
  __HAL_RCC_PWR_CLK_ENABLE();
  __HAL_PWR_VOLTAGESCALING_CONFIG(PWR_REGULATOR_VOLTAGE_SCALE1);
  /** Initializes the RCC Oscillators according to the specified parameters
  * in the RCC_OscInitTypeDef structure.
  */
  RCC_OscInitStruct.OscillatorType = RCC_OSCILLATORTYPE_HSE;
  RCC_OscInitStruct.HSEState = RCC_HSE_ON;
  RCC_OscInitStruct.PLL.PLLState = RCC_PLL_ON;
  RCC_OscInitStruct.PLL.PLLSource = RCC_PLLSOURCE_HSE;
  RCC_OscInitStruct.PLL.PLLM = 25;
  RCC_OscInitStruct.PLL.PLLN = 192;
  RCC_OscInitStruct.PLL.PLLP = RCC_PLLP_DIV2;
  RCC_OscInitStruct.PLL.PLLQ = 4;
  if (HAL_RCC_OscConfig(&RCC_OscInitStruct) != HAL_OK)
  {
    Error_Handler();
  }
  /** Initializes the CPU, AHB and APB buses clocks
  */
  RCC_ClkInitStruct.ClockType = RCC_CLOCKTYPE_HCLK|RCC_CLOCKTYPE_SYSCLK
                              |RCC_CLOCKTYPE_PCLK1|RCC_CLOCKTYPE_PCLK2;
  RCC_ClkInitStruct.SYSCLKSource = RCC_SYSCLKSOURCE_PLLCLK;
  RCC_ClkInitStruct.AHBCLKDivider = RCC_SYSCLK_DIV1;
  RCC_ClkInitStruct.APB1CLKDivider = RCC_HCLK_DIV4;
  RCC_ClkInitStruct.APB2CLKDivider = RCC_HCLK_DIV2;

