z2care/STM32F407VET6_OV5640_Barcode_Common/Core/Inc/usart.h
void DCMI_DMA_MemInc_En(void)
{
    HAL_DMA_DeInit(&hdma_dcmi);

    hdma_dcmi.Init.MemInc = DMA_MINC_ENABLE;
    if (HAL_DMA_Init(&hdma_dcmi) != HAL_OK)
    {
      Error_Handler();
    }
}

void DCMI_DMA_MemInc_Den(void)
{
    HAL_DMA_DeInit(&hdma_dcmi);
    hdma_dcmi.Init.MemInc = DMA_MINC_DISABLE;
    if (HAL_DMA_Init(&hdma_dcmi) != HAL_OK)
    {
      Error_Handler();
    }
}

void SPI2_ENDIAN_L(void)
{
	HAL_SPI_DeInit(&hspi2) ;
	hspi2.Init.FirstBit = SPI_FIRSTBIT_LSB;
	  if (HAL_SPI_Init(&hspi2) != HAL_OK)
	  {
	    Error_Handler();
	  }
}

void SPI2_ENDIAN_H(void)
{
	HAL_SPI_DeInit(&hspi2) ;
	hspi2.Init.FirstBit = SPI_FIRSTBIT_MSB;
	  if (HAL_SPI_Init(&hspi2) != HAL_OK)
	  {
	    Error_Handler();
	  }
}
/* USER CODE END 4 */

/**
  * @brief  This function is executed in case of error occurrence.
  * @retval None
  */
void Error_Handler(void)
{
  /* USER CODE BEGIN Error_Handler_Debug */
  /* User can add his own implementation to report the HAL error return state */

  /* USER CODE END Error_Handler_Debug */
}

#ifdef  USE_FULL_ASSERT
/**
  * @brief  Reports the name of the source file and the source line number
  *         where the assert_param error has occurred.
  * @param  file: pointer to the source file name
  * @param  line: assert_param error line source number
  * @retval None
  */
void assert_failed(uint8_t *file, uint32_t line)
{
  /* USER CODE BEGIN 6 */
  /* User can add his own implementation to report the file name and line number,
     tex: printf("Wrong parameters value: file %s on line %d\r\n", file, line) */
  /* USER CODE END 6 */
}
#endif /* USE_FULL_ASSERT */

/************************ (C) COPYRIGHT STMicroelectronics *****END OF FILE****/

















#else //RAW format

/* USER CODE BEGIN Header */
/**
  ******************************************************************************
  * @file           : main.c
  * @brief          : Main program body
  ******************************************************************************
  * @attention
  *
  * <h2><center>&copy; Copyright (c) 2020 STMicroelectronics.
  * All rights reserved.</center></h2>
  *
  * This software component is licensed by ST under BSD 3-Clause license,
  * the "License"; You may not use this file except in compliance with the
  * License. You may obtain a copy of the License at:
  *                        opensource.org/licenses/BSD-3-Clause
  *
  ******************************************************************************
  */
/* USER CODE END Header */
/* Includes ------------------------------------------------------------------*/
#include "main.h"

/* Private includes ----------------------------------------------------------*/
/* USER CODE BEGIN Includes */
#define RowNum 480
#define ColumnNum 1280

void DCMI_DMA_MemInc_En(void);
void DCMI_DMA_MemInc_Den(void);
void SPI2_ENDIAN_L(void) ;
void SPI2_ENDIAN_H(void) ;



/* USER CODE END Includes */

/* Private typedef -----------------------------------------------------------*/
/* USER CODE BEGIN PTD */
uint8_t aRxBuffer;			//接收中断缓冲
uint8_t Uart1_RxBuff[99] = {0};		//Rx buffer，should be adjusted according to Rx max byte length per communication.
uint8_t Uart2_RxBuff[99] = {0};		//Rx buffer，should be adjusted according to Rx max byte length per communication.
HAL_StatusTypeDef uart1_status_rx;
uint8_t Uart1_TxBuff[99] = {0};		//Tx buffer
uint8_t Uart4_TxBuff[2] = {0};			//Tx buffer
uint8_t StatusFlag = 0;

uint8_t ov2640_rd = 0xff;

uint8_t sram_wd;
uint8_t sram_rd;

uint8_t sram_TxCmd[4]={0x02,0x00,0x00,0x00};
uint8_t sram_TxData= 0x5a;
uint8_t sram_RxCmd[4]={0x03,0x00,0x00,0x00};
uint8_t sram_RxDummy= 0x00;
uint8_t sram_RxData= 0x00;

uint8_t sram_RxCmd_inv[4]={0xc0,0x00,0x00,0x00}; //for LSB of SPI2

HAL_StatusTypeDef spi_dma_status = HAL_OK;
HAL_StatusTypeDef dcmi_dma_status = HAL_OK;

uint32_t dcmi_data;

uint32_t dcmi_data_buff[19200]={0};

uint32_t vsync_counter = 0;
uint32_t line_counter = 0;
uint32_t point_counter =0;
uint32_t frame_counter =0;
uint32_t timing_ctr = 1;

uint8_t DCMI_CROP_EN = 0;
uint32_t DCMI_RN = 0;  //row number
uint32_t DCMI_CN = 0;  //column number
uint32_t DCMI_RS = 0;  //row start
uint32_t DCMI_CS = 0;  //column start


uint8_t scmd = 0;


/* USER CODE END PTD */

/* Private define ------------------------------------------------------------*/
/* USER CODE BEGIN PD */

/* USER CODE END PD */

/* Private macro -------------------------------------------------------------*/
/* USER CODE BEGIN PM */

/* USER CODE END PM */

/* Private variables ---------------------------------------------------------*/
DCMI_HandleTypeDef hdcmi;
DMA_HandleTypeDef hdma_dcmi;

SPI_HandleTypeDef hspi2;
DMA_HandleTypeDef hdma_spi2_tx;

TIM_HandleTypeDef htim2;

UART_HandleTypeDef huart4;
UART_HandleTypeDef huart1;
UART_HandleTypeDef huart2;

/* USER CODE BEGIN PV */

/* USER CODE END PV */

/* Private function prototypes -----------------------------------------------*/
void SystemClock_Config(void);
static void MX_GPIO_Init(void);
static void MX_DMA_Init(void);
static void MX_USART1_UART_Init(void);
static void MX_TIM2_Init(void);
static void MX_SPI2_Init(void);
static void MX_DCMI_Init(void);
static void MX_UART4_Init(void);
static void MX_USART2_UART_Init(void);
static void MX_NVIC_Init(void);
/* USER CODE BEGIN PFP */

/* USER CODE END PFP */

/* Private user code ---------------------------------------------------------*/
/* USER CODE BEGIN 0 */

/* USER CODE END 0 */

/**
  * @brief  The application entry point.
  * @retval int
  */
int main(void)
{
  /* USER CODE BEGIN 1 */

  /* USER CODE END 1 */

  /* MCU Configuration--------------------------------------------------------*/

  /* Reset of all peripherals, Initializes the Flash interface and the Systick. */
   HAL_Init();

  /* USER CODE BEGIN Init */

  /* USER CODE END Init */

  /* Configure the system clock */
  SystemClock_Config();

  /* USER CODE BEGIN SysInit */

  /* USER CODE END SysInit */

  /* Initialize all configured peripherals */
  MX_GPIO_Init();
  MX_DMA_Init();
  MX_USART1_UART_Init();
  MX_TIM2_Init();
  MX_SPI2_Init();
  MX_DCMI_Init();
  MX_UART4_Init();
  MX_USART2_UART_Init();

  /* Initialize interrupts */
  MX_NVIC_Init();
  /* USER CODE BEGIN 2 */

  HAL_TIM_PWM_Start(&htim2, TIM_CHANNEL_1);
  HAL_Delay(100);

  if (HAL_UART_Receive_IT(&huart1, (uint8_t *)&aRxBuffer, 1)!=HAL_OK) printf("UART1 IT FAILED! \r\n");
  printf("Serial port connected!");
  printf("\r\n");
  HAL_UART_Receive_IT(&huart2, (uint8_t *)&aRxBuffer, 1);

    HAL_Delay(500); //must to await camera running stable
    SCCB_Rst();
    HAL_Delay(500);

