z2care/STM32F407VET6_OV5640_Barcode_Common/Core/Inc/usart.h
	SCCB_WR_Reg(0xff, 0x01);
 	SCCB_WR_Reg(0x12, 0x80);

    HAL_Delay(100);

	ov2640_rd = SCCB_RD_Reg(0x1c);
	printf("PID = %d",ov2640_rd);
	printf("\r\n");
	ov2640_rd = SCCB_RD_Reg(0x1d);
	printf("VER = %d",ov2640_rd);
	printf("\r\n");




		//SVGA Preview, 25fps, 24 Mhz input clock
		SCCB_WR_Reg(0xff, 0x01);
		SCCB_WR_Reg(0x11, 0x00);
		SCCB_WR_Reg(0x12, 0x40);
		SCCB_WR_Reg(0x2a, 0x00);
		SCCB_WR_Reg(0x2b, 0x00);
		SCCB_WR_Reg(0x46, 0x87);
		SCCB_WR_Reg(0x47, 0x00);
		SCCB_WR_Reg(0x3d, 0x38);


  		for(uint32_t i=0; i<sizeof(ov2640_svga_init_reg_tbl)/2 ; i++)
  	     {
  	       SCCB_WR_Reg(ov2640_svga_init_reg_tbl[i][0],ov2640_svga_init_reg_tbl[i][1]);
  		   if(i<10) HAL_Delay(5);
   	     }

		OV2640_YUV422_Mode();

		SCCB_WR_Reg(0xff, 0x01);
  		SCCB_WR_Reg(0x11, 0x04);  //revised by Pegasus Yu. PCLK can't be too fast to be captured by STM32 input pin.
  		SCCB_WR_Reg(0x32, 0x09);  //Warn: PCLK can't be adjusted here. Or it will affect vsync normal output.


		OV2640_Window_Set(140,4,800,600);
        OV2640_ImageSize_Set(800,600);
    	OV2640_ImageWin_Set(0,0,800,600);
    	OV2640_OutSize_Set(160,240);


     OV2640_Color_Bar(0);
     OV2640_Auto_Exposure(2);
     OV2640_Special_Effects(0);
     OV2640_Light_Mode(0);    //自动模式
     OV2640_Color_Saturation(2);//色彩饱和度
     OV2640_Brightness(2);    //亮度0
     OV2640_Contrast(2);        //对比度

	 HAL_Delay(500); //pay attention

	   DCMI_CROP_EN = 1;
	   DCMI_RN = 159;  //row number
	   DCMI_CN = 320;  //column number
	   DCMI_RS = 0;  //row start
	   DCMI_CS = 0;  //column start
	   OV2640_PD ;
	   HAL_DCMI_DisableCrop (&hdcmi);
	   HAL_DCMI_ConfigCrop (&hdcmi, DCMI_CS, DCMI_RS, DCMI_CN, DCMI_RN);
	   HAL_DCMI_EnableCrop (&hdcmi);
	   dcmi_dma_status = HAL_DCMI_Start_DMA(&hdcmi, DCMI_MODE_SNAPSHOT, &dcmi_data, (DCMI_RN+1)*DCMI_CN/4); //65535 38400 (DCMI_RN+1)*DCMI_CN/4
	   OV2640_PU ;
	   printf("dcmi_dma_status = %d",dcmi_dma_status);
	   printf("\r\n");

	   HAL_Delay(250);  //pay attention

	   HAL_DCMI_Stop(&hdcmi);
		printf("\r\n");
		printf("vn = %d",vsync_counter);
		printf("\r\n");
		printf("ln = %d",line_counter);
		printf("\r\n");
		printf("pn = %d",point_counter);
		printf("\r\n");
		printf("fn = %d",frame_counter);
		printf("\r\n");


		HAL_GPIO_WritePin(GPIOE, GPIO_PIN_13, GPIO_PIN_RESET);
  /* USER CODE END 2 */

  /* Infinite loop */
  /* USER CODE BEGIN WHILE */
  while (1)
  {
    /* USER CODE END WHILE */

    /* USER CODE BEGIN 3 */

  	HAL_Delay(1);

    if (scmd==1)
    {
    	scmd = 0;

    	 vsync_counter = 0;
    	 line_counter = 0;
    	 frame_counter =0;
    	 point_counter = 0;

      	  DCMI_DMA_MemInc_En();

      	  HAL_DCMI_DisableCrop (&hdcmi);
      	  HAL_Delay(100);
       	  Uart4_TxBuff[0]=0x55;
          Uart4_TxBuff[1]=0xaa;
      	  HAL_UART_Transmit(&huart4, Uart4_TxBuff, 2, 0xFFFFFF);

    	  for (uint8_t i=0; i<13;i++)
    	  {

    				//OV2640_Window_Set(140,0,800,640);
    		        //OV2640_ImageSize_Set(800,640);

    		    	OV2640_ImageWin_Set(0,i*48,800,48);
    		    	OV2640_OutSize_Set(800,48);
    		    	HAL_Delay(100);


    		     dcmi_dma_status = HAL_DCMI_Init(&hdcmi);

    	    	 HAL_Delay(100);

    	    	 dcmi_dma_status = HAL_DCMI_Start_DMA(&hdcmi, DCMI_MODE_SNAPSHOT, dcmi_data_buff, 76800/4);

    	    	 HAL_Delay(250);

    	    	 HAL_DCMI_Stop(&hdcmi);

    	    	  HAL_UART_Transmit(&huart4, (uint8_t *)dcmi_data_buff, 38400, 0xFFFFFF);
    	    	  HAL_UART_Transmit(&huart4, (uint8_t *)(&dcmi_data_buff[38400/4]), 38400, 0xFFFFFF);
    	    	  //HAL_Delay(200);

    	        	memset(dcmi_data_buff, 0, 76800);
    	        	HAL_Delay(10);


    	  }

    }


    if (scmd==2)
    {
     	scmd = 0;


     }


  }
  /* USER CODE END 3 */
}

/**
  * @brief System Clock Configuration
  * @retval None
  */
void SystemClock_Config(void)
{
  RCC_OscInitTypeDef RCC_OscInitStruct = {0};
  RCC_ClkInitTypeDef RCC_ClkInitStruct = {0};

  /** Configure the main internal regulator output voltage
  */
  __HAL_RCC_PWR_CLK_ENABLE();
  __HAL_PWR_VOLTAGESCALING_CONFIG(PWR_REGULATOR_VOLTAGE_SCALE1);
  /** Initializes the RCC Oscillators according to the specified parameters
  * in the RCC_OscInitTypeDef structure.
  */
  RCC_OscInitStruct.OscillatorType = RCC_OSCILLATORTYPE_HSE;
  RCC_OscInitStruct.HSEState = RCC_HSE_ON;
  RCC_OscInitStruct.PLL.PLLState = RCC_PLL_ON;
  RCC_OscInitStruct.PLL.PLLSource = RCC_PLLSOURCE_HSE;
  RCC_OscInitStruct.PLL.PLLM = 25;
  RCC_OscInitStruct.PLL.PLLN = 192;
  RCC_OscInitStruct.PLL.PLLP = RCC_PLLP_DIV2;
  RCC_OscInitStruct.PLL.PLLQ = 4;
  if (HAL_RCC_OscConfig(&RCC_OscInitStruct) != HAL_OK)
  {
    Error_Handler();
  }
  /** Initializes the CPU, AHB and APB buses clocks
  */
  RCC_ClkInitStruct.ClockType = RCC_CLOCKTYPE_HCLK|RCC_CLOCKTYPE_SYSCLK
                              |RCC_CLOCKTYPE_PCLK1|RCC_CLOCKTYPE_PCLK2;
  RCC_ClkInitStruct.SYSCLKSource = RCC_SYSCLKSOURCE_PLLCLK;
  RCC_ClkInitStruct.AHBCLKDivider = RCC_SYSCLK_DIV1;
  RCC_ClkInitStruct.APB1CLKDivider = RCC_HCLK_DIV4;
  RCC_ClkInitStruct.APB2CLKDivider = RCC_HCLK_DIV2;

  if (HAL_RCC_ClockConfig(&RCC_ClkInitStruct, FLASH_LATENCY_3) != HAL_OK)
  {
    Error_Handler();
  }
}

/**
  * @brief NVIC Configuration.
  * @retval None
  */
static void MX_NVIC_Init(void)
{
  /* USART1_IRQn interrupt configuration */
  HAL_NVIC_SetPriority(USART1_IRQn, 1, 0);
  HAL_NVIC_EnableIRQ(USART1_IRQn);
  /* TIM2_IRQn interrupt configuration */
  HAL_NVIC_SetPriority(TIM2_IRQn, 0, 0);
  HAL_NVIC_EnableIRQ(TIM2_IRQn);
}

/**
  * @brief DCMI Initialization Function
  * @param None
  * @retval None
  */
static void MX_DCMI_Init(void)
{

  /* USER CODE BEGIN DCMI_Init 0 */

  /* USER CODE END DCMI_Init 0 */

  /* USER CODE BEGIN DCMI_Init 1 */

  /* USER CODE END DCMI_Init 1 */
  hdcmi.Instance = DCMI;
  hdcmi.Init.SynchroMode = DCMI_SYNCHRO_HARDWARE;
  hdcmi.Init.PCKPolarity = DCMI_PCKPOLARITY_RISING;
  hdcmi.Init.VSPolarity = DCMI_VSPOLARITY_LOW;
  hdcmi.Init.HSPolarity = DCMI_HSPOLARITY_LOW;
  hdcmi.Init.CaptureRate = DCMI_CR_ALL_FRAME;
  hdcmi.Init.ExtendedDataMode = DCMI_EXTEND_DATA_8B;
  hdcmi.Init.JPEGMode = DCMI_JPEG_DISABLE;
  if (HAL_DCMI_Init(&hdcmi) != HAL_OK)
  {
    Error_Handler();
  }
  /* USER CODE BEGIN DCMI_Init 2 */

  /* USER CODE END DCMI_Init 2 */

