z2care/STM32F407VET6_OV5640_Barcode_Common/Core/Inc/usart.h
  /*Configure GPIO pin : PE6 */
  GPIO_InitStruct.Pin = GPIO_PIN_6;
  GPIO_InitStruct.Mode = GPIO_MODE_INPUT;
  GPIO_InitStruct.Pull = GPIO_NOPULL;
  HAL_GPIO_Init(GPIOE, &GPIO_InitStruct);

  /*Configure GPIO pins : PB0 PB1 */
  GPIO_InitStruct.Pin = GPIO_PIN_0|GPIO_PIN_1;
  GPIO_InitStruct.Mode = GPIO_MODE_OUTPUT_OD;
  GPIO_InitStruct.Pull = GPIO_PULLUP;
  GPIO_InitStruct.Speed = GPIO_SPEED_FREQ_VERY_HIGH;
  HAL_GPIO_Init(GPIOB, &GPIO_InitStruct);

  /*Configure GPIO pin : PE13 */
  GPIO_InitStruct.Pin = GPIO_PIN_13;
  GPIO_InitStruct.Mode = GPIO_MODE_OUTPUT_PP;
  GPIO_InitStruct.Pull = GPIO_NOPULL;
  GPIO_InitStruct.Speed = GPIO_SPEED_FREQ_LOW;
  HAL_GPIO_Init(GPIOE, &GPIO_InitStruct);

  /*Configure GPIO pins : PD10 PD11 */
  GPIO_InitStruct.Pin = GPIO_PIN_10|GPIO_PIN_11;
  GPIO_InitStruct.Mode = GPIO_MODE_OUTPUT_PP;
  GPIO_InitStruct.Pull = GPIO_NOPULL;
  GPIO_InitStruct.Speed = GPIO_SPEED_FREQ_LOW;
  HAL_GPIO_Init(GPIOD, &GPIO_InitStruct);

}

/* USER CODE BEGIN 4 */
void HAL_UART_RxCpltCallback(UART_HandleTypeDef *huart)
{
/*
 * Due to the hardware fault of STM32F407VET6 development board, the RX receiving bytes will be return to TX. It can be obvious at 9600 baud-rate.
 */
	extern uint8_t scmd;

	if (huart ==  &huart1)
	{


		if (aRxBuffer==0x00)
		{
			HAL_Delay(500); //dummy time for hardware fault of serial port circuit in STM32F407VET6 development board
			printf("OV2640 Camera Menu!");
			printf("\r\n");
			HAL_UART_Receive_IT(&huart1, (uint8_t *)&aRxBuffer, 1);
		}
		else if(aRxBuffer==0x01)		{
			HAL_Delay(500); //dummy time for hardware fault of serial port circuit in STM32F407VET6 development board
			scmd = 1;

			HAL_UART_Receive_IT(&huart1, (uint8_t *)&aRxBuffer, 1);
		}
		else if(aRxBuffer==0x02)		{
			HAL_Delay(500); //dummy time for hardware fault of serial port circuit in STM32F407VET6 development board
			scmd = 2;

			HAL_UART_Receive_IT(&huart1, (uint8_t *)&aRxBuffer, 1);
		}
		else if(aRxBuffer==0x03)		{
			HAL_Delay(500); //dummy time for hardware fault of serial port circuit in STM32F407VET6 development board
			scmd = 3;

			HAL_UART_Receive_IT(&huart1, (uint8_t *)&aRxBuffer, 1);
		}
		else if(aRxBuffer==0x04)		{
			HAL_Delay(500); //dummy time for hardware fault of serial port circuit in STM32F407VET6 development board
			scmd = 4;

			HAL_UART_Receive_IT(&huart1, (uint8_t *)&aRxBuffer, 1);
		}
		else if(aRxBuffer==0x05)		{
			HAL_Delay(500); //dummy time for hardware fault of serial port circuit in STM32F407VET6 development board
			scmd = 5;

			HAL_UART_Receive_IT(&huart1, (uint8_t *)&aRxBuffer, 1);
		}
		else
		{

		HAL_UART_Receive_IT(&huart1, (uint8_t *)&aRxBuffer, 1);

		}

	}

	if (huart ==  &huart2)
	{


		if (aRxBuffer==0x00)
		{
			printf("OV2640 Camera Menu!");
			printf("\r\n");
			HAL_UART_Receive_IT(&huart2, (uint8_t *)&aRxBuffer, 1);
		}
		else if(aRxBuffer==0x01)		{
			scmd = 1;

			HAL_UART_Receive_IT(&huart2, (uint8_t *)&aRxBuffer, 1);
		}
		else if(aRxBuffer==0x02)		{
			scmd = 2;

			HAL_UART_Receive_IT(&huart2, (uint8_t *)&aRxBuffer, 1);
		}
		else if(aRxBuffer==0x03)		{
			scmd = 3;

			HAL_UART_Receive_IT(&huart2, (uint8_t *)&aRxBuffer, 1);
		}
		else if(aRxBuffer==0x04)		{
			scmd = 4;

			HAL_UART_Receive_IT(&huart2, (uint8_t *)&aRxBuffer, 1);
		}
		else if(aRxBuffer==0x05)		{
			scmd = 5;

			HAL_UART_Receive_IT(&huart2, (uint8_t *)&aRxBuffer, 1);
		}
		else
		{

		HAL_UART_Receive_IT(&huart2, (uint8_t *)&aRxBuffer, 1);

		}

	}

      return;
}

/*
 * In hardware synchronization mode, only four interrupts can be used (IT_LINE, IT_FRAME, IT_OVR and IT_DCMI_VSYNC) but in embedded synchronization mode all the five interrupts can be used.
 */
void HAL_DCMI_VsyncEventCallback(DCMI_HandleTypeDef *hdcmi)  //w/ response
{
	extern uint32_t vsync_counter;
	extern uint32_t timing_ctr;
	static uint32_t cc=0;



	vsync_counter++;

	if (DCMI_CROP_EN==1)
	{
		   timing_ctr = 0;
	}
	else
	{
		if (vsync_counter%2==0)
		{
			timing_ctr = 1;
			while(HAL_DCMI_GetState(&hdcmi)== HAL_DCMI_STATE_BUSY) cc++;
		}
		else
		{
			timing_ctr = 0;
		}

	}

}

void HAL_DCMI_LineEventCallback(DCMI_HandleTypeDef *hdcmi)  //w/ response
{
	extern uint32_t line_counter;
	extern uint32_t point_counter;
	extern uint32_t timing_ctr;



	if (timing_ctr==0)
		{
		  if (line_counter==DCMI_RS)
		   {
			point_counter = __HAL_DMA_GET_COUNTER(&hdma_dcmi); //__HAL_DMA_GET_COUNTER(&hdma_dcmi):The left transmission times

		   }
		  if (line_counter==(DCMI_RS+1))
		   {
			point_counter = point_counter - __HAL_DMA_GET_COUNTER(&hdma_dcmi);

		   }
		  line_counter++;
		}


}

void HAL_DCMI_FrameEventCallback(DCMI_HandleTypeDef *hdcmi) //w/ response
{
	extern uint32_t frame_counter;
	extern uint32_t timing_ctr;
	//static uint32_t dd=0;

	frame_counter++;

	if (DCMI_CROP_EN==1)
	{
		timing_ctr = 1;
	}
}

void HAL_DCMI_VsyncCallback(DCMI_HandleTypeDef *hdcmi) //w/o response
{
	//extern uint32_t vsync_counter;
	//vsync_counter++;

}

void HAL_DCMI_HsyncCallback(DCMI_HandleTypeDef *hdcmi)  //w/o response
{
	//extern uint32_t vsync_counter;
	//vsync_counter++;
}



void DCMI_DMA_MemInc_En(void)
{
    HAL_DMA_DeInit(&hdma_dcmi);

    hdma_dcmi.Init.MemInc = DMA_MINC_ENABLE;
    if (HAL_DMA_Init(&hdma_dcmi) != HAL_OK)
    {
      Error_Handler();
    }
}

void DCMI_DMA_MemInc_Den(void)
{
    HAL_DMA_DeInit(&hdma_dcmi);
    hdma_dcmi.Init.MemInc = DMA_MINC_DISABLE;
    if (HAL_DMA_Init(&hdma_dcmi) != HAL_OK)
    {
      Error_Handler();
    }
}

void SPI2_ENDIAN_L(void)
{
	HAL_SPI_DeInit(&hspi2) ;
	hspi2.Init.FirstBit = SPI_FIRSTBIT_LSB;
	  if (HAL_SPI_Init(&hspi2) != HAL_OK)
	  {
	    Error_Handler();
	  }
}

void SPI2_ENDIAN_H(void)
{
	HAL_SPI_DeInit(&hspi2) ;
	hspi2.Init.FirstBit = SPI_FIRSTBIT_MSB;
	  if (HAL_SPI_Init(&hspi2) != HAL_OK)
	  {
	    Error_Handler();
	  }
}
/* USER CODE END 4 */

/**
  * @brief  This function is executed in case of error occurrence.
  * @retval None
  */
void Error_Handler(void)
{
  /* USER CODE BEGIN Error_Handler_Debug */
  /* User can add his own implementation to report the HAL error return state */

  /* USER CODE END Error_Handler_Debug */
}

#ifdef  USE_FULL_ASSERT
/**
  * @brief  Reports the name of the source file and the source line number
  *         where the assert_param error has occurred.
  * @param  file: pointer to the source file name
  * @param  line: assert_param error line source number
  * @retval None
  */
void assert_failed(uint8_t *file, uint32_t line)
{
  /* USER CODE BEGIN 6 */
  /* User can add his own implementation to report the file name and line number,
     tex: printf("Wrong parameters value: file %s on line %d\r\n", file, line) */
  /* USER CODE END 6 */
}
#endif /* USE_FULL_ASSERT */

/************************ (C) COPYRIGHT STMicroelectronics *****END OF FILE****/





















#endif


#endif
